In [1]:
import pandas as pd

In [2]:
df = pd.read_excel('D:\\Data science\\Machine learning\\linear_regression\\price.xlsx')
df

      town  area   price
0    surat  2600  550000
1    surat  3000  565000
2    surat  3200  610000
3  bardoli  3600  680000
4  bardoli  4000  725000

In [5]:
dm = pd.get_dummies(df.town)
dm

   bardoli  surat
0        0      1
1        0      1
2        0      1
3        1      0
4        1      0

In [44]:
new_df = pd.concat([df,dm],axis='columns')
new_df

      town  area   price  bardoli  surat
0    surat  2600  550000        0      1
1    surat  3000  565000        0      1
2    surat  3200  610000        0      1
3  bardoli  3600  680000        1      0
4  bardoli  4000  725000        1      0

In [46]:
x = new_df.drop('town',axis='columns')
x

   area   price  bardoli  surat
0  2600  550000        0      1
1  3000  565000        0      1
2  3200  610000        0      1
3  3600  680000        1      0
4  4000  725000        1      0

In [47]:
p_df = x.drop('price', axis='columns')
p_df

   area  bardoli  surat
0  2600        0      1
1  3000        0      1
2  3200        0      1
3  3600        1      0
4  4000        1      0

In [20]:
y = new_df.price
y

0    550000
1    565000
2    610000
3    680000
4    725000
Name: price, dtype: int64

In [48]:
from sklearn.linear_model import LinearRegression

model = LinearRegression()
model.fit(p_df,y)

LinearRegression(copy_X=True, fit_intercept=True, n_jobs=None, normalize=False)

In [49]:
model.predict([[3400,0,1]])

array([620500.])

In [50]:
model.predict([[2800,1,0]])

array([605000.])

# Different method:

In [52]:
from sklearn.preprocessing import LabelEncoder
le = LabelEncoder()

In [55]:
dfle = df
dfle.town = le.fit_transform(dfle.town)
dfle

   town  area   price
0     1  2600  550000
1     1  3000  565000
2     1  3200  610000
3     0  3600  680000
4     0  4000  725000

In [76]:
x = dfle[['town','area']].values
x

array([[   1, 2600],
       [   1, 3000],
       [   1, 3200],
       [   0, 3600],
       [   0, 4000]], dtype=int64)

In [77]:
y = dfle.price.values
y

array([550000, 565000, 610000, 680000, 725000], dtype=int64)

In [89]:
from sklearn.preprocessing import OneHotEncoder
ohe = OneHotEncoder(categories=[0])

In [93]:
x = ohe.fit_transform(x).toarray()
x

ValueError: Shape mismatch: if categories is an array, it has to be of shape (n_features,).

In [58]:
model1 = LinearRegression()
model1.fit(x,y)

LinearRegression(copy_X=True, fit_intercept=True, n_jobs=None, normalize=False)

In [59]:
model1.predict([[3400,1]])

array([-1.45867902e+08])

# Exercise:

In [107]:
df = pd.read_csv('D:\\Data science\\Machine learning\\Dummy variable & hotEncoding\\carprices.csv')
df

          CarModel  Mileage  SellPrice  Age
0           BMW X5    69000      18000    6
1           BMW X5    35000      34000    3
2           BMW X5    57000      26100    5
3           BMW X5    22500      40000    2
4           BMW X5    46000      31500    4
5             Audi    59000      29400    5
6             Audi    52000      32000    5
7             Audi    72000      19300    6
8             Audi    91000      12000    8
9   Mercedez Benz     67000      22000    6
10  Mercedez Benz     83000      20000    7
11  Mercedez Benz     79000      21000    7
12  Mercedez Benz     59000      33000    5
13          Toyota    51000      42000    4
14          Toyota    65000      32000    7
15          Toyota    39000      55000    5

In [119]:
dm = pd.get_dummies(df.CarModel)
cc = pd.concat([df,dm],axis='columns')
new_df = cc.drop('CarModel',axis='columns')
new_df_ = new_df.drop('SellPrice', axis='columns')
new_df_

    Mileage  Age  Audi  BMW X5  Mercedez Benz   Toyota
0     69000    6     0       1               0       0
1     35000    3     0       1               0       0
2     57000    5     0       1               0       0
3     22500    2     0       1               0       0
4     46000    4     0       1               0       0
5     59000    5     1       0               0       0
6     52000    5     1       0               0       0
7     72000    6     1       0               0       0
8     91000    8     1       0               0       0
9     67000    6     0       0               1       0
10    83000    7     0       0               1       0
11    79000    7     0       0               1       0
12    59000    5     0       0               1       0
13    51000    4     0       0               0       1
14    65000    7     0       0               0       1
15    39000    5     0       0               0       1

In [111]:
sp = df.SellPrice
sp

0     18000
1     34000
2     26100
3     40000
4     31500
5     29400
6     32000
7     19300
8     12000
9     22000
10    20000
11    21000
12    33000
13    42000
14    32000
15    55000
Name: SellPrice, dtype: int64

In [112]:
from sklearn.linear_model import LinearRegression

model = LinearRegression()
model.fit(new_df_,sp)

LinearRegression(copy_X=True, fit_intercept=True, n_jobs=None, normalize=False)

In [113]:
model.predict([[40000,10,0,1,0,0]])

array([39693.16331854])

In [116]:
model.predict([[21000,2,0,0,1,0]])

array([51015.88503866])